# Commands for the Cisco 2690 Switch

## ToC

* [Explaining Shell Prompts](#explaining-shell-prompts)
* [Privileged Mode](#privileged-mode)
* [Saving Changes](#saving-changes)
* [Configuration Mode](#configuration-mode)
* [Reload Config](#reload-config)
* [The Exit Command](#the-exit-command)
* [Set Password](#set-password)
* [Show Interface Configuration](#show-interface-configuration)
* [VLAN Configuration](#vlan-configuration)
  * [Setup VLAN](#setup-vlan)
  * [Remove VLAN](#remove-vlan)
  * [Assign VLAN to Network Interface](#assign-vlan-to-network-interface)
    * [Configure Access Mode](#configure-access-mode)
    * [Configure Trunk Mode](#configure-trunk-mode)
    * [Set Tagged VLAN on Trunk](#set-tagged-vlan-on-trunk)
* [Link Aggregation](#link-aggregation) 
  * [Show Etherchannel Configuration](#show-etherchannel-configuration)

## Explaining Shell Prompts

The shell prompt is the text that the CLI shows to the user. As an example a prompt
can look like this:

```shell
Switch>
```

or this:

```shell
Switch#
```

or this:

```shell
Switch(config-vlan)#
```

In the following document, please pay close attention to the prompt, as it shows in
which mode you currently are and what you are currently configuring.  

## Privileged Mode

If the prompt shows:

```shell
Switch>
```

You are in unprivileged mode. But if it shows a `#` at the end you are in privileged mode:

```shell
Switch#
```

To enter privileged mode, use the following command:

```shell
enable
```

If a password is set, you should now be prompted to enter it. After typing it confirm 
with the "Enter" key. 

## Saving changes

To save configured changes, you have to copy the `running-config` file to the `startup-config` file.
This must be done in [privileged mode](#privileged-mode).

```shell
copy running-config startup-config
```

The prompt should now ask you for the filename, which you can just confirm by pressing
the "Enter" key, because we have already specified it. Check the value in the brackets
(`[` `]`) before confirming.

```shell
Destination filename [startup-config]? 
```

After completion, the CLI should show something like this:

```shell
Switch#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
```

## Configuration Mode

To change most settings in the switch configuration, you must enter the configuration 
mode. This can be achieved by:

1. Entering [privileged mode](#privileged-mode)
2. Enter configuration mode
```shell
configure terminal
```

> [!TIP]
> You can also use `configure t` to enter configuration mode

The prompt should now show `Switch(config)#`

## Reload Config

If you want to reload the switch configuration, either because you did something 
and want to revert your unsaved changes or if you want to make sure our changes have 
been saved correctly. You can use the `reload` command in [privileged mode](#privileged-mode):

```shell
reload
```

## The Exit Command

If you want to exit a configuration mode or privileged mode, or any other mode really, 
you can use the exit command:

```shell
exit
```

For example, if you are in [privileged mode](#privileged-mode), you can exit to unprivileged mode:

```shell
Switch# exit
Switch> 
```

## Set Password

1. Be sure to be in [privileged mode](#privileged-mode). The CLI should show the prompt `Switch#`.
2. Enter [configuration mode](#configuration-mode)
3. The prompt should now show `Switch(config)#`
4. ```shell
   # Set Password
   enable secret <PASSWORD>
   
   # Exit configuration mode
   exit
   ```
5. Now [save the changes](#saving-changes) and [reload](#reload-config) the switch.
6. After the reload you can test the password. The CLI should now show the prompt `Switch>`.
7. ```shell
   # Enter privileged mode
   enable
   ```
8. Now enter your Password when prompted.

## Show Interface Configuration

1. Enter [privileged mode](#privileged-mode) 
2. Enter the command `interfaces <INTERFACE_NAME> switchport`
    *  ```shell
       show interfaces FastEthernet0/3 switchport
       ```
3. The result should look something like this
    ```shell
    Switch#show interfaces FastEthernet0/3 switchport
    Name: Fa0/3
    Switchport: Enabled
    Administrative Mode: trunk
    Operational Mode: trunk
    Administrative Trunking Encapsulation: dot1q
    Operational Trunking Encapsulation: dot1q
    Negotiation of Trunking: On
    Access Mode VLAN: 1 (default)
    Trunking Native Mode VLAN: 1 (default)
    Voice VLAN: none
    Administrative private-vlan host-association: none
    Administrative private-vlan mapping: none
    Administrative private-vlan trunk native VLAN: none
    Administrative private-vlan trunk encapsulation: dot1q
    Administrative private-vlan trunk normal VLANs: none
    Administrative private-vlan trunk private VLANs: none
    Operational private-vlan: none
    Trunking VLANs Enabled: All
    Pruning VLANs Enabled: 2-1001
    Capture Mode Disabled
    Capture VLANs Allowed: ALL
    Protected: false
    ```

## VLAN Configuration

### Setup VLAN

This is used to associate a VLAN name with an ID. This can also be viewed as an initial
VLAN configuration on the current device.

1. Enter [privileged mode](#privileged-mode)
2. Enter [configuration mode](#configuration-mode)
3. The prompt should now show `Switch(config)#`
4. Select the VLAN ID
   ```shell
   vlan 10
   ```
5. The prompt should now show `Switch(config-vlan)#`
6. Set the VLAN name
   ```shell
   name Internal
   ```
7. Exit the configuration mode until the prompt shows `Switch#`
8. Save changes

#### Example

```shell
# Enter privileged mode
Switch> enable
Switch# configure terminal

# Configure VLAN ID
Switch(config)# vlan 10
# Configure VLAN Name
Switch(config-vlan)#name Internal
# Exit VLAN Config
Switch(config-vlan)#exit

# Exit configuration mode and save changes
Switch(config)# end
Switch#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
```

### Remove VLAN

This removes a configured VLAN.

1. Enter [privileged mode](#privileged-mode)
2. Enter [configuration mode](#configuration-mode)
3. Remove VLAN
   ```shell
   no vlan <vlan_id>
   ```
4. Exit the configuration mode until the prompt shows `Switch#`
5. Save changes

### Assign VLAN to Network Interface

> [!NOTE]  
> A switch port, where you plug in the network cable is also referred to as
> a "Network Interface"

VLANs can be assigned to network interfaces in two modes:

* Access Mode (Untagged)
* Trunk Mode (Tagged)

> [!IMPORTANT]  
> 1. If you want to assign multiple VLANs to an interface, you must use Trunk Mode.
> 2. It is possible to have one untagged VLAN configured on an interface in Trunk mode
> 3. Access mode can only ever have one VLAN configured
> 4. Access mode can only ever be in untagged mode

#### Configure Access Mode

1. Enter [privileged mode](#privileged-mode)
2. Enter [configuration mode](#configuration-mode)
3. Define the interface to configure
   * The name of the interface can be viewed in the "Configure" tab in the switches UI
   ```shell
   interface FastEthernet0/1
   ```
   * The prompt should now show `Switch(config-if)#`
4. Set the network interface mode
   ```shell
   switchport mode access
   ```
5. Define the VLAN configured for the interface
   ```shell
   switchport access vlan 10
   ```
6. Exit the configuration mode until the prompt shows `Switch#`
7. Save changes

##### Full Example

```shell
# Enter privileged mode
Switch> enable
Switch# configure terminal

# Select the interface to configure
Switch(config)# interface FastEthernet0/1

# Define VLAN mode
Switch(config-if)# switchport mode access

# Set VLAN ID
Switch(config-if)# switchport access vlan 10

# End and save configuration
Switch(config-if)# exit
Switch(config)# exit
Switch#copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
```

#### Configure Trunk Mode

1. Enter [privileged mode](#privileged-mode)
2. Enter [configuration mode](#configuration-mode)
3. Define the interface to configure
    * The name of the interface can be viewed in the "Configure" tab in the switches UI
   ```shell
   interface FastEthernet0/3
   ```
    * The prompt should now show `Switch(config-if)#`
4. Set the network interface mode
   ```shell
   switchport mode trunk
   ```
5. Define the allowed VLANs to be trunked
   ```shell
   switchport trunk allowed vlan 1,10,99
   ```
6. Exit the configuration mode until the prompt shows `Switch#`
7. Save changes

##### Full Example

```shell
# Enter privileged mode
Switch> enable
Switch# configure terminal

# Select the interface to configure
Switch(config)# interface FastEthernet0/3

# Define VLAN mode
Switch(config-if)# switchport mode trunk

# Define allowed ports to trunk
Switch(config-if)# switchport trunk allowed vlan 1,10,99

# End and save configuration
Switch(config-if)# exit
Switch(config)# exit
Switch#copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
```

#### Set Tagged VLAN on Trunk

1. Enter [privileged mode](#privileged-mode)
2. Enter [configuration mode](#configuration-mode)
3. Define the interface to configure
    * The name of the interface can be viewed in the "Configure" tab in the switches UI
   ```shell
   interface FastEthernet0/3
   ```
    * The prompt should now show `Switch(config-if)#`
4. Set the network interface mode
   ```shell
   switchport mode trunk
   ```
5. Define the untagged VLAN 
   ```shell
   switchport trunk native vlan 1
   ```
6. Exit the configuration mode until the prompt shows `Switch#`
7. Save changes

##### Full Example

```shell
# Enter privileged mode
Switch> enable
Switch# configure terminal

# Select the interface to configure
Switch(config)# interface FastEthernet0/3

# Define VLAN mode
Switch(config-if)# switchport mode trunk

# Define the native VLAN ID
Switch(config-if)# switchport trunk native vlan 1

# End and save configuration
Switch(config-if)# exit
Switch(config)# exit
Switch#copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
```

## Link Aggregation

1. Enter [privileged mode](#privileged-mode)
2. Enter [configuration mode](#configuration-mode)
3. Define the interface to configure
    * The name of the interface can be viewed in the "Configure" tab in the switches UI
    ```shell
    interface FastEthernet0/23
    ```
    * The prompt should now show `Switch(config-if)#`
4. Set the port either to [access](#configure-access-mode) or [trunk](#configure-trunk-mode) mode
   * In this example we use trunk mode
   ```shell
   switchport mode trunk
   switchport trunk allowed vlan 1,10,99
   ```
5. Assign a channel group to the port and define the mode
   * All available modes can be found in the [cisco documentation](https://www.cisco.com/c/en/us/td/docs/switches/lan/catalyst2960x/software/15-2_3_e/consolidated_guide/b_1523e_consolidated_2960x_cg/b_consolidated_152ex_2960-X_cg_chapter_010010.html#concept_4685AEC0AD9E4DBFA49AEE35D3B4A028)
   ```shell
   channel-group 1 mode active
   ```
6. Repeat the same step on the second port on the same device
7. Exit the configuration mode until the prompt shows `Switch#`
8. Save changes

Now link aggregation is configured on one switch. It must also be configured on a
second switch connected to the first one to work as intended.

### Show Etherchannel Configuration

1. Enter [privileged mode](#privileged-mode)
2. Show the etherchannel summary
   ```shell
   show etherchannel summary
   ```
3. The output should show something like this

#### Example Output

```shell
tk-sw-001#show etherchannel summary
Flags:  D - down        P - in port-channel
        I - stand-alone s - suspended
        H - Hot-standby (LACP only)
        R - Layer3      S - Layer2
        U - in use      f - failed to allocate aggregator
        u - unsuitable for bundling
        w - waiting to be aggregated
        d - default port


Number of channel-groups in use: 1
Number of aggregators:           1

Group  Port-channel  Protocol    Ports
------+-------------+-----------+----------------------------------------------

1      Po1(SU)           LACP   Fa0/23(P) Fa0/24(P) 
```