# Commands for the Cisco 2690 Switch

## ToC

* [Set Password](#set-password)

## Set Password

Be sure to be in privileged mode. The CLI should show the prompt `Switch#`. If not execute `enable`.

```shell
# Enter configuration mode
configure terminal

# Set Password
enable secret <PASSWORD>

# Exit configuration mode
end

# Apply current config to startup-config
# Confirm by pressing enter when prompted for a filename
copy running-config startup-config

# Reload the switch
reload
```

After the reload you can test the password. The CLI should now show the prompt `Switch>`.

```shell
# Enter privileged mode
enable
```

Now enter your Password.

## Show interface config

```shell
Switch> enable
Switch#show interfaces FastEthernet0/3 switchport
Name: Fa0/3
Switchport: Enabled
Administrative Mode: trunk
Operational Mode: trunk
Administrative Trunking Encapsulation: dot1q
Operational Trunking Encapsulation: dot1q
Negotiation of Trunking: On
Access Mode VLAN: 1 (default)
Trunking Native Mode VLAN: 1 (default)
Voice VLAN: none
Administrative private-vlan host-association: none
Administrative private-vlan mapping: none
Administrative private-vlan trunk native VLAN: none
Administrative private-vlan trunk encapsulation: dot1q
Administrative private-vlan trunk normal VLANs: none
Administrative private-vlan trunk private VLANs: none
Operational private-vlan: none
Trunking VLANs Enabled: All
Pruning VLANs Enabled: 2-1001
Capture Mode Disabled
Capture VLANs Allowed: ALL
Protected: false

```

## VLAN Configuration

Configure vlan ID and name:

```shell
# Enter privileged mode
Switch> enable
Switch# configure terminal

# Configure VLAN ID
Switch(config)# vlan 10
# Configure VLAN Name
Switch(config-vlan)#name Internal
# Exit VLAN Config
Switch(config-vlan)#exit

# Exit configuration mode and save changes
Switch(config)# end
Switch#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
```

VLANs can be removed by:

```shell
no vlan <vlan_id>
```

Assign VLAN to interface:

```shell
# Enter privileged mode
Switch> enable
Switch# configure terminal

# Select the interface to configure
Switch(config)# interface FastEthernet0/1

# Define VLAN mode
Switch(config-if)# switchport mode access

# Set VLAN ID
Switch(config-if)# switchport access vlan 10

# End and save configuration
Switch(config-if)# exit
Switch(config)# end
Switch#copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
```

Define port as trunk:

```shell
# Enter privileged mode
Switch> enable
Switch# configure terminal

# Select the interface to configure
Switch(config)# interface FastEthernet0/3

# Define VLAN mode
Switch(config-if)# switchport mode trunk

# Define allowed ports to trunk
Switch(config-if)# switchport trunk allowed vlan 1,10,99

# End and save configuration
Switch(config-if)# exit
Switch(config)# end
Switch#copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
```
